<template>
  <div class="all">
    <div class="header">
      <div>单项选择</div>
      <div>
        <Button type="info" shape="circle" style="font-size: 12px;" @click="multipleChoice">多选测试</Button>
      </div>
      <div>
        <Button type="primary" @click="modal1 = true">返回主菜单</Button>
        <Modal v-model="modal1" title="返回" @on-ok="on" @on-cancel="cancel">
          <p style="font-size: 16px;">是否返回主菜单 ？ （返回后所选答案将全部清空）</p>
        </Modal>
        <Button type="primary" @click="radom">
          <Icon style="margin-right:10px" size="16" type="md-refresh" />重新模拟
        </Button>
        <Button type="primary" @click="submit">提交试卷</Button>
      </div>
    </div>
    <Divider style="margin-bottom: 5px" />
    <div class="body" style="width: 100% hight: 100%">
      <div v-for="item in uniterming" :key="item.id" style="margin: 0px 20px 20px">
        {{item.id}}.
        {{item.name}}
        <RadioGroup style="display: inline-flex" @on-change="xx">
          <Radio label="A">
            <span>A</span>
          </Radio>
          <Radio label="B">
            <span>B</span>
          </Radio>
          <Radio label="C">
            <span>C</span>
          </Radio>
        </RadioGroup>
        <label style="color: red" :style="{display: answer}">正确答案为：{{item.key}}</label>
        <div style="margin-left: 20px">{{item.val}}</div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "",
  components: {},
  data() {
    return {
      answer: "none",
      modal1: false,
      uniterming: [
        {
          id: 1,
          val: "A.物质力量  B.精神力量 C.社会力量",
          key: "B",
          name:
            "入党动机是一个人要求入党的内在动力和真实目的，是推动其争取入党的（ ）。"
        },
        {
          id: 2,
          val: "A.主动地向党组织汇报    B.完成本职工作    C.热心帮助同志",
          key: "A",
          name:
            "在争取入党的过程中，既要（     ），又要积极参加党的活动，还要认真接受党组织的培训。"
        },
        {
          id: 3,
          val: "A.政治指引    B.精神动力    C.旗帜方向",
          key: "B",
          name: "思想是行动的先导，正确的动机，是正确行动的（     ）。"
        },
        {
          id: 4,
          val: "A.无产阶级专政    B.共产主义的社会制度    C.人民当家作主",
          key: "B",
          name: "共产党人的最高理想和最终目标，就是实现（     ）。"
        },
        {
          id: 5,
          val:
            "A.领导廉洁从政规范      B.领导干部廉洁自律规范 C.党员领导干部廉洁自律规范",
          key: "C",
          name:
            "《中国共产党廉洁自律准则》分为两部分：一是党员廉洁自律规范；二是（   ）。"
        },
        {
          id: 6,
          val: "A.坚持党的基本路线  B.坚定理想信念  C.坚决维护党中央权威",
          key: "B",
          name:
            "《关于新形势下党内政治生活的若干准则》提出：必须高度重视思想政治建设，把(   )作为开展党内政治生活的首要任务。"
        },
        {
          id: 7,
          val:
            "A.实到会有表决权党员人数的三分之二    B.实到会有表决权党员人数的半数   C.应到会有表决权党员人数的三分之二",
          key: "B",
          name: "支部党员大会表决事项以赞成票超过（     ）为通过。"
        },
        {
          id: 8,
          val: "A.知行统一    B.言行一致    C.自省自警   ",
          key: "B",
          name:
            "党员要维护党的团结和统一，对党忠诚老实，（   ），坚决反对一切派别组织和小集团活动，反对阳奉阴违的两面派行为和一切阴谋诡计。"
        },
        {
          id: 9,
          val:
            "A.党员个人服从党的组织    B.少数服从多数    C.全党各级组织和全体党员服从党的全国代表大会和中央委员会",
          key: "C",
          name: "党章规定的“四个服从”中最重要的是（     ）。"
        },
        {
          id: 10,
          val: "A.党小组会议    B.支部党员大会    C.党委会",
          key: "B",
          name:
            "预备党员转为正式党员，或延长预备期或取消预备党员资格，都应经（     ）讨论通过和上级党组织批准。"
        },
        {
          id: 11,
          val:
            "A.一样    B.除没有表决权.被选举权外一样    C.除没有表决权.选举权和被选举权以外一样 ",
          key: "C",
          name: "预备党员的权利同正式党员（     ）。"
        },
        {
          id: 12,
          val: "A.少数服从多数    B.个人服从组织   C.下级服从上级",
          key: "A",
          name: "党组织讨论决定问题，必须执行（     ）原则。"
        },
        {
          id: 13,
          val: "A.自我革命    B.思想改造    C.批评和自我批评",
          key: "C",
          name:
            "党员义务要求党员要切实开展（     ），勇于揭露和纠正工作中的缺点.错误，坚决同消极腐败现象作斗争。"
        },
        {
          id: 14,
          val: "A.十五天    B.二十天    C.一个月",
          key: "C",
          name:
            "党纪处分决定做出后，应当在（     ）内向受处分党员所在党的基层组织中的全体党员及其本人宣布。"
        },
        {
          id: 15,
          val: "A.二年    B.三年    C.五年  ",
          key: "C",
          name: "党员受到开除党籍处分，（     ）内不得重新入党。"
        },
        {
          id: 16,
          val: "A.批评教育    B.延长预备期    C.批评教育或延长预备期    ",
          key: "C",
          name:
            "预备党员违犯党纪，情节较轻，尚可保留预备党员资格,应当对其如何进行处理。（     ）"
        },
        {
          id: 17,
          val: "A.党性    B.党风    C.党建",
          key: "B",
          name:
            "中国共产党执政90多年来，始终把（     ）问题看作是事关党的生死存亡的突出问题。"
        },
        {
          id: 18,
          val: "Ａ.党的八大    Ｂ.党的十二大    Ｃ.党的十四大",
          key: "B",
          name: "把入党誓词写入党章，始于（     ）党章。"
        },
        {
          id: 19,
          val: "A.在野党    B.反对党    C.参政党",
          key: "C",
          name:
            "在中国共产党的多党合作制度体系中，共产党是执政党，民主党派是（     ）。"
        },
        {
          id: 20,
          val: "Ａ.1921年7月23日   Ｂ.1922年7月23日  Ｃ.1923年7月21日",
          key: "A",
          name: "中国共产党第一次代表大会于（     ）召开。"
        },
        {
          id: 21,
          val: "A.给予处分    B.劝他退党    C.自动退党",
          key: "B",
          name:
            "党员缺乏革命意志，不履行党员义务，不符合党员条件，党的支部应当对他进行教育，要求他限期改正；经教育仍无转变的，应当（     ）。"
        },
        {
          id: 22,
          val:
            "A.坦白从宽.抗拒从严    B.惩前毖后.治病救人    C.严肃批评.教育为主",
          key: "B",
          name:
            "党章规定，党组织对违犯党的纪律的党员，应当本着（     ）的精神，按照错误性质和情节轻重，给以批评教育直至纪律处分。"
        },
        {
          id: 23,
          val: "A.抓彻底       B.严到底       C.零容忍  ",
          key: "C",
          name:
            "习近平总书记强调，惩治腐败这一手必须紧抓不放.利剑高悬，坚持无禁区.全覆盖.（  ）。"
        },
        {
          id: 24,
          val: "A.实现人民生活富裕    B.维护社会稳定    C.推进现代化建设",
          key: "C",
          name:
            "中国共产党的三大历史任务包括（     ）.完成祖国统一.维护世界和平与促进共同发展。"
        },
        {
          id: 25,
          val: "A.先进性    B.纯洁性     C.先进性和纯洁性",
          key: "C",
          name:
            "中国共产党要领导全国各族人民实现社会主义现代化的宏伟目标，必须紧密围绕党的基本路线，加强党的执政能力建设.（   ）建设。"
        },
        {
          id: 26,
          val: "A.法律和政策规定范围内    B.合理    C.必要",
          key: "A",
          name:
            "除了（     ）的个人利益和工作职权外，所有共产党员都不得谋求任何私利和特权。"
        },
        {
          id: 27,
          val: "A.党    B.政府    C.人民",
          key: "C",
          name: "中华人民共和国的一切权力属于（     ）。"
        },
        {
          id: 28,
          val: "A.每月    B.每两个月    C.每季度",
          key: "C",
          name:
            "支部党员大会是党支部的议事决策机构，由全体党员参加，一般（   ）召开1次。"
        },
        {
          id: 29,
          val: "A.每月    B.每两个月    C.每季度",
          key: "A",
          name: "党支部委员会会议一般（   ）召开1次，根据需要可以随时召开。"
        },
        {
          id: 30,
          val: "A.每月    B.每两个月    C.每季度    D.每半年",
          key: "A",
          name:
            "党小组会一般（   ）召开1次，组织党员参加政治学习.谈心谈话.开展批评和自我批评等。"
        },
        {
          id: 31,
          val: "A.每月    B.每季度    C.每年",
          key: "C",
          name: "党支部（   ）至少召开1次组织生活会，也可以根据需要随时召开。"
        },
        {
          id: 32,
          val: "A.中国共产党的领导    B.马克思主义    C.为人民服务",
          key: "A",
          name: "中国特色社会主义最本质的特征是（    ）"
        },
        {
          id: 33,
          val: "A.一致    B.互补    C.协调",
          key: "A",
          name: "坚持党在宪法和法律范围内活动，与坚持党的领导是（      ）的。"
        },
        {
          id: 34,
          val: "A.听党指挥   B.牺牲奉献    C.艰苦奋斗",
          key: "A",
          name:
            "历史和现实表明，（     ）是我军从胜利走向胜利的根本前提和保证。"
        },
        {
          id: 35,
          val: "A.党的阶级性和先进性    B.党的根本宗旨    C.党的地位和作用",
          key: "C",
          name:
            "中国共产党是中国社会主义事业的领导核心，这句话说明了（      ）。"
        },
        {
          id: 36,
          val: "A.警告    B.撤销党内职务    C.留党察看",
          key: "A",
          name: "党内五种纪律处分中最低的处分是（     ）。"
        },
        {
          id: 37,
          val: "A.判处死刑    B.撤销职务    C.开除党籍",
          key: "C",
          name: "（     ）是党内的最高处分。"
        },
        {
          id: 38,
          val: "A.一年    B.二年    C.三年 ",
          key: "B",
          name:
            "依据党的纪律处分条例规定，党员受留党察看处分，最长不超过（     ）。"
        },
        {
          id: 39,
          val: "A.警告    B.严重警告    C.开除党籍",
          key: "C",
          name:
            "党员经过留党察看，确已改正错误的，应当恢复其党员的权利；坚持错误不改的，应当（     ）。"
        },
        {
          id: 40,
          val: "A.二年    B.三年    C.四年",
          key: "A",
          name:
            "受到撤销党内职务处分的党员，在受处分后（     ）年内，不得在党内担任和向党外组织推荐担任与其原任职务相当或者高于原任的职务。"
        },
        {
          id: 41,
          val: "A.开除公职    B.严重警告    C.通报批评 ",
          key: "B",
          name:
            "根据党章和《中国共产党纪律处分条例》的规定，下列属于党内纪律处分的是（     ）。"
        },
        {
          id: 42,
          val:
            "A.本人无权参加    B.本人有权参加，但不能进行申辩    C.本人有权参加和进行申辩",
          key: "C",
          name: "在党组织讨论决定对党员的党纪处分或做出鉴定时，（     ）。"
        },
        {
          id: 43,
          val: "A.自然撤销    B.暂时保留    C.视情况而定 ",
          key: "A",
          name: "党员受到留党察看处分，其党内职务（     ）。"
        },
        {
          id: 44,
          val: "A.经过大家公议    B.同本人见面    C.向党内外公开",
          key: "B",
          name:
            "党组织对党员做出处分决定时，所依据的事实材料和处分必须（     ），听取本人说明情况和申辩。"
        },
        {
          id: 45,
          val: "A.党的纪律    B.党的威信    C.党的规定 ",
          key: "A",
          name: "党组织必须严格执行和维护（     ）。"
        },
        {
          id: 46,
          val: "A.下级服从上级    B.少数服从多数   C.先民主后集中",
          key: "B",
          name:
            "党员进行表决或投票，实行“（     ）”的原则，每人只有一票，而且这一票具有同等效力。"
        },
        {
          id: 47,
          val:
            "Ａ.团小组会    Ｂ.支部团员大会    Ｃ.团总支委员会    D.团员大会",
          key: "B",
          name:
            "团组织做好“推优”工作，召开（     ），由团支部委员会介绍推荐的发展对象人选情况，进行民主测评，确定推荐对象。"
        },
        {
          id: 48,
          val:
            "Ａ.推荐优秀团员进行表彰    Ｂ.推荐优秀同志作为团员发展对象    Ｃ.推荐优秀团员作为党员发展对象",
          key: "C",
          name: "共青团要做好“推优”工作，“推优”是指（     ）。"
        },
        {
          id: 49,
          val: "Ａ.必须    Ｂ.不一定    Ｃ.在一定条件下可以",
          key: "A",
          name: "团员加入党组织（     ）经过团组织推荐。"
        },
        {
          id: 50,
          val: "Ａ.团的各级委员会书记和副书记    Ｂ.团委书记    Ｃ.集体",
          key: "C",
          name:
            "共青团的各级委员会必须坚持民主集中制，实行集体领导和个人分工负责相结合的制度；凡属重要问题，必须由（     ）讨论决定。"
        },
        {
          id: 51,
          val: "A.自觉    B.不自觉    C.反对",
          key: "A",
          name: "申请入党的积极分子必须（     ）接收党组织的培养教育和考察。"
        },
        {
          id: 52,
          val: "A.全面的    B.不全面的    C.片面的",
          key: "A",
          name:
            "入党积极分子主动向党组织汇报思想.工作.学习情况，必须是（     ），而不能以偏概全。"
        },
        {
          id: 53,
          val: "A.完全    B.部分    C.在某些方面",
          key: "A",
          name:
            "确认入党积极分子已经（     ）具备党员条件，才能按照入党的程序，接收其加入中国共产党。"
        },
        {
          id: 54,
          val: "A.三个月    B.六个月    C.一年",
          key: "C",
          name:
            "入党积极分子必须经过党组织（     ）以上的培养教育，才能吸收入党。"
        },
        {
          id: 55,
          val: "A.人民当家作主  B.共产主义  C.共同富裕",
          key: "B",
          name: "党的最高理想和最终目标是实现(    )。"
        },
        {
          id: 56,
          val:
            "A.阶级斗争 B.改革.发展与稳定之间的矛盾 C.人民日益增长的物质文化需要同落后的社会生产之间的矛盾",
          key: "C",
          name: "在现阶段，我国社会的主要矛盾是(    )。"
        },
        {
          id: 57,
          val: "A.依法治国       B.物质生产      C.精神文明建设",
          key: "A",
          name:
            "中国共产党领导人民发展社会主义民主政治，必须坚持党的领导.人民当家作主.(    )的有机统一。"
        },
        {
          id: 58,
          val: "A.政治协商     	B.民主协商     C.民主集中制",
          key: "A",
          name: "中国共产党领导的多党合作和(    )制度是我国的一项基本政治制度。"
        },
        {
          id: 59,
          val: "A.中国人民	  B.中华民族	   C.中国人民和中华民族	",
          key: "C",
          name:
            "中国共产党是中国工人阶级的先锋队，同时是(    )的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。"
        },
        {
          id: 60,
          val: "A.社会主义荣辱观  B.科学发展  C.社会主义核心价值观",
          key: "B",
          name:
            "中国共产党以马克思列宁主义.毛泽东思想.邓小平理论.“三个代表”重要思想和(    )作为自己的行动指南。"
        },
        {
          id: 61,
          val: "A.共产党执政规律  B.社会主义建设规  C.人类社会历史发展规律	",
          key: "C",
          name:
            "党章指出，马克思列宁主义揭示了(    )，它的基本原理是正确的，具有强大的生命力。"
        },
        {
          id: 62,
          val: "A.发展	      B.开放    	C.改革",
          key: "A",
          name: "党章指出，(    )是我们党执政兴国的第一要务。"
        },
        {
          id: 63,
          val: "A.求真务实      B.实事求是     C.与时俱进	",
          key: "B",
          name:
            "党章指出，党的思想路线是一切从实际出发，理论联系实际，(    )，在实践中检验真理和发展真理。"
        },
        {
          id: 64,
          val: "A.党的思想路线    B.党的政治路线    C.党的群众路线	",
          key: "C",
          name:
            "“一切为了群众，一切依靠群众，从群众中来，到群众中去，把党的正确主张变为群众的自觉行动。”这是党章对(    )的表述。"
        },
        {
          id: 65,
          val: "A.民族区域自治           B.人民代表大会 C.共产党领导的多党合作	",
          key: "A",
          name:
            "党章指出，中国共产党坚持实行和不断完善(    )制度，积极培养.选拔少数民族干部，帮助各少数民族地区发展经济.文化，实现各民族的共同繁荣和全面进步。"
        },
        {
          id: 66,
          val: "A.和平谈判    	B.两岸三通     	C.一个国家.两种制度",
          key: "C",
          name:
            "党章指出，中国共产党主张按照(    )的方针，促进香港.澳门长期繁荣稳定，完成祖国统一的大业。"
        },
        {
          id: 67,
          val: "A.规范化	         B.科学化       	C.制度化",
          key: "B",
          name: "党章指出，要全面提高党的建设(    )水平。	"
        },
        {
          id: 68,
          val: "A.科学型       B.制度型        C.服务型",
          key: "C",
          name:
            "党章指出，要不断提高党的创造力.凝聚力.战斗力，建设学习型.(    ).创新型的马克思主义执政党，使我们党始终走在时代前列，成为领导全国人民沿着中国特色社会主义道路不断前进的坚强核心。"
        },
        {
          id: 69,
          val: "A.密切联系群众	  B.理论联系实际  C.批评与自我批评",
          key: "A",
          name: "党章指出，中国共产党的最大政治优势是(    )。"
        },
        {
          id: 70,
          val: "A.决策失误      	B.脱离群众	      C.思想僵化",
          key: "B",
          name: "党章指出，中国共产党执政后的最大危险是(    )。"
        },
        {
          id: 71,
          val: "A.公有制    	 B.集体所有制     	C.全民所有制	",
          key: "A",
          name:
            "党章指出，在社会主义初级阶段，我国必须坚持和完善(    )为主体.多种所有制经济共同发展的基本经济制度。"
        },
        {
          id: 72,
          val: "A.中国共产党的领导            B.改革开放    C.以经济建设为中心",
          key: "A",
          name:
            "党章指出，坚持社会主义道路.坚持人民民主专政.坚持(    ).坚持马克思列宁主义毛泽东思想这四项基本原则，是我们的立国之本。"
        },
        {
          id: 73,
          val: "A.以经济建设为中心    B.改革开放    C.科教兴国战略",
          key: "B",
          name: "党章指出，坚持(    )是我们的强国之路。"
        },
        {
          id: 74,
          val:
            "A.民主基础上的集中       B.集中指导下的民主  C.民主基础上的集中和集中指导下的民主相结合",
          key: "C",
          name: "党章指出，民主集中制是(    )。"
        },
        {
          id: 75,
          val: "A.中青年	    B.青少年	    C.先进青年",
          key: "C",
          name:
            "党章指出，中国共产主义青年团是中国共产党领导的(    )的群众组织。"
        },
        {
          id: 76,
          val: "A.十六岁       	B.十八岁     	C.二十岁",
          key: "B",
          name: "党章规定，可以申请入党的年龄为年满(    )。"
        },
        {
          id: 77,
          val: "A.开除	         B.罢免         C.辞退",
          key: "B",
          name:
            "党章规定，党员除了享有表决权.选举权和被选举权以外，还有权要求(    )或撤换不称职的干部。"
        },
        {
          id: 78,
          val:
            "A.本人无权参加和进行申辩  B.其他党员不可以为他作证和辩护  C.本人有权参加和进行申辩，其他党员可以为他作证和辩护",
          key: "C",
          name:
            "党章规定，在党组织讨论决定对党员的党纪处分或作出鉴定时，下列说法中，正确的应该是(    )。"
        },
        {
          id: 79,
          val:
            "A.可以不执行党的决议和政策  B.在坚决执行的前提下，可以声明保留，并且可以把自己的意见向党的上级组织直至中央提出   C.必须坚决执行，不可以声明保留，也不允许向上级组织提出",
          key: "B",
          name:
            "党章规定，当党员对党的决议和政策有不同意见时，下列说法中，正确的应该是(    )。"
        },
        {
          id: 80,
          val: "A.党的路线方针政策	     B.党的纲领和党的章程  C.党的历史",
          key: "B",
          name:
            "党章规定，入党介绍人的任务是认真了解申请人的思想.品质.经历和工作表现，向他解释(    )，说明党员的条件.义务和权利，并向党组织做出负责的报告。"
        },
        {
          id: 81,
          val: "A.遵守党的章程   B.遵守国家的法律   C.遵守党的纪律",
          key: "A",
          name:
            "入党誓词如下：我志愿加入中国共产党，拥护党的纲领，(    )，履行党员义务，执行党的决定，严守党的纪律，保守党的秘密，对党忠诚，积极工作，为共产主义奋斗终身，随时准备为党和人民牺牲一切，永不叛党。"
        },
        {
          id: 82,
          val: "A.开除	        B.除名	      C.给予党纪处分",
          key: "B",
          name:
            "党章规定，党员要求退党，应当经支部大会讨论后宣布(    )，并报上级党组织备案。"
        },
        {
          id: 83,
          val:
            "A.不履行党员义务          B.不行使党员权利  C.不参加党的组织生活",
          key: "A",
          name:
            "党章规定，党员缺乏革命意志，(    )，不符合党员条件，党的支部应当对他进行教育，要求他限期改正；经教育仍无转变的，应当劝他退党。"
        },
        {
          id: 84,
          val: "A.3个月	       B.6个月	     C.12个月",
          key: "B",
          name:
            "党章规定，党员如果没有正当理由，连续(    )不参加党的组织生活，或不交纳党费，或不做党所分配的工作，就被认为是自行脱党。"
        },
        {
          id: 85,
          val: "A.集体领导      B.个人分工负责  C.集体领导和个人分工负责相结合",
          key: "C",
          name: "党章规定，党的各级委员会实行(    )的制度。"
        },
        {
          id: 86,
          val:
            "A.党的全国代表大会和它所产生的中央委员会  B.中央军事委员会            C.中央书记处",
          key: "A",
          name: "党章规定，党的最高领导机关是(    )。"
        },
        {
          id: 87,
          val:
            "A.同级党委书记办公会        B.同级党的代表大会  C.同级党委常委会",
          key: "B",
          name: "党章规定，党的各级委员会向(    )负责并报告工作。"
        },
        {
          id: 88,
          val:
            "A.党员和群众一律平等  B.不同级别的党员干部有所区别  C.所有党员一律平等	",
          key: "C",
          name: "党章规定，在党的纪律面前(    )。"
        },
        {
          id: 89,
          val: "A.5         B.4	        C.3",
          key: "A",
          name: "党章规定，党的省.自治区.直辖市的代表大会，每(    )年举行一次。"
        },
        {
          id: 90,
          val: "A.3人      B.5人        C.10人	",
          key: "A",
          name:
            "党章规定，各基层单位，凡是有正式党员(    )以上，都应当成立党的基层组织。"
        },
        {
          id: 91,
          val: "A.基层组织	        B.基层干部       	C.基层党员",
          key: "A",
          name: "党章指出，党的(    )是党的全部工作和战斗力的基础。"
        },
        {
          id: 92,
          val: "A.1年或2年	        B.2年或3年	     C.3年或4年",
          key: "B",
          name: "党章规定，党总支部委员会和支部委员会每届任期(    )。"
        },
        {
          id: 93,
          val: "A.举手表决    	B.无记名投票	    C.鼓掌通过	",
          key: "B",
          name:
            "党章规定，党的各级代表大会的代表和委员会的产生，要采取(    )选举方式。"
        },
        {
          id: 94,
          val: "A.支委会	      B.党小组会	     C.党员大会	",
          key: "C",
          name: "党章规定，基层党的总支部委员会和支部委员会由(    )选举产生。"
        },
        {
          id: 95,
          val: "A.2至3年	    B.3至4年	     C.3至5年",
          key: "C",
          name: "党章规定，党的基层委员会每届任期为(    )。"
        },
        {
          id: 96,
          val: "A.政绩突出  	 B.德才兼备.以德为先   	C.政治性强	",
          key: "B",
          name: "党章规定，党按照(    )的原则选拔干部。"
        },
        {
          id: 97,
          val: "A.五湖四海     B.政绩突出     C.政治性强	",
          key: "A",
          name: "党章规定，党选拔干部坚持(    ).任人唯贤，反对任人唯亲。"
        },
        {
          id: 98,
          val: "A.从严治党  B.批评与自我批评	C.惩前毖后.治病救人",
          key: "C",
          name:
            "党章规定，党组织对违犯党的纪律的党员，应当本着(    )的精神，按照错误性质和情节轻重，给以批评教育直至纪律处分。"
        },
        {
          id: 99,
          val: "A.开除党籍	     B.留党察看	    C.撤销党内职务",
          key: "A",
          name: "党章规定，对于严重触犯刑律的党员，必须给予(    )的纪律处分。"
        },
        {
          id: 100,
          val: "A.半年           B.1年         C.2年",
          key: "C",
          name: "党章规定，留党察看的期限最长不超过(    )。"
        },
        {
          id: 101,
          val: "A.1年         	B.2年       	C.3年",
          key: "A",
          name: "党章规定，中国共产党预备党员的预备期为(    )。"
        },
        {
          id: 102,
          val:
            "A.递交入党申请书          B.递交入党志愿书  C.支部大会通过他为预备党员",
          key: "C",
          name:
            "《中国共产党发展党员工作细则》规定，预备党员的预备期，从(    )之日算起。"
        },
        {
          id: 103,
          val: "A.半年         	B.1年      	C.2年",
          key: "B",
          name:
            "《中国共产党发展党员工作细则》规定，党组织认为需要继续考察和教育的，可以延长预备期，但不能超过(    )。"
        },
        {
          id: 104,
          val: "A.留党察看  B.延长预备期  C.取消预备党员资格	",
          key: "C",
          name:
            "《中国共产党发展党员工作细则》规定，预备党员预备期满后，党组织经过考察认为其不履行党员义务，不具备党员条件的，应当(    )。"
        },
        {
          id: 105,
          val: "A.支部大会     B.支部委员会     C.党小组",
          key: "A",
          name:
            "党章规定，预备党员转为正式党员，或延长预备期，或取消预备党员资格，都应当经(    )讨论通过和上级党组织批准。"
        },
        {
          id: 106,
          val: "A.党员领导干部    B.正式党员    C.预备党员",
          key: "B",
          name:
            "党章规定，申请入党的人必须有两名党员作介绍人。这里的党员是指(    )。"
        },
        {
          id: 107,
          val:
            "A.递交入党志愿书    B.支部大会通过他为预备党员	 C.预备期满转为正式党员",
          key: "B",
          name: "党章规定，党员的党籍从(    )之日算起。"
        },
        {
          id: 108,
          val:
            "A.递交入党志愿书    B.支部大会通过他为预备党员  C.预备期满转为正式党员",
          key: "C",
          name: "党章规定，党员的党龄从(    )之日算起。"
        },
        {
          id: 109,
          val: "A．三个月			B．半年			C．一年",
          key: "B",
          name:
            "《中国共产党发展党员工作细则》规定，党支部每(    )对入党积极分子进行一次考察。 "
        },
        {
          id: 110,
          val: "A.一至两名      B.两至三名      C.一至三名",
          key: "A",
          name:
            "《中国共产党发展党员工作细则》规定，党组织应当指定(    )正式党员作入党积极分子的培养联系人。"
        },
        {
          id: 111,
          val: "A．党委         B．党组       C．党总支",
          key: "A",
          name: "《中国共产党发展党员工作细则》规定，预备党员必须由(    )审批。"
        },
        {
          id: 112,
          val: "A．接受单位党组织  B．入党介绍人  C．原所在党组织",
          key: "C",
          name:
            "《中国共产党发展党员工作细则》规定，预备期未满的预备党员工作.学习所在单位（居住地）发生变动，应当及时报告(    )。"
        },
        {
          id: 113,
          val:
            "A.《中国共产党章程》        B.《中国共产党纲领》  C.《中国共产党第二次全国大会宣言》",
          key: "A",
          name:
            ".1922年7月16日至23日，党的二大在上海举行。大会通过的(    )，是党成立后依据马克思主义建党学说和列宁的建党原则制定的第一部党章。"
        },
        {
          id: 114,
          val: "A.左倾           B.右倾           C.教条主义",
          key: "B",
          name:
            "1927年4月27日至5月9日，党的五大在武汉举行。大会对陈独秀在大革命中的(    )错误进行了批评，通过了《政治形势与党的任务决议案》等文件。"
        },
        {
          id: 115,
          val: "A.绝对服从党的领导      B.做好党的宣传工作  C.维护党的纪律",
          key: "A",
          name:
            "古田会议通过的决议案规定红军是一个执行革命的政治任务的武装集团，必须(    )，必须担负起打仗.筹款和做群众工作三位一体的任务。"
        },
        {
          id: 116,
          val: "A.了解         B.调查         C.分析",
          key: "B",
          name:
            "为了反对党和红军中的教条主义思想，毛泽东在1930年5月写下一篇题为《调查工作》的文章，提出了“没有(    )，就没有发言权”的科学论断。"
        },
        {
          id: 117,
          val: "A.淞沪会战    B.“九一八”事变    C.“七七”事变",
          key: "B",
          name:
            "(    )标志着日本帝国主义全面侵华战争的开始，也是中国全面抗日战争的起点。		"
        },
        {
          id: 118,
          val:
            "A.1934年9月到1935年9月  B.1934年9月到1936年9月  C.1934年10月到1936年10月",
          key: "C",
          name:
            "中国红军长征，是指中国工农红军主力从长江以南各革命根据地向陕甘革命根据地会合的战略转移，起止时间是（    ）"
        },
        {
          id: 119,
          val: "A.反帝反封建      B.联合抗敌      C.抗日救亡",
          key: "C",
          name:
            "“一二九”抗日爱国运C动公开揭露了日本吞并华北进而侵略全中国的阴谋，极大地促进了中华民族的觉醒，标志着中国人民(    )运动新高潮的到来。"
        },
        {
          id: 120,
          val: "A.建立联合政府   B.抗日民族统一战线   C.反蒋抗日",
          key: "B",
          name:
            "1935年12月，中共中央政治局在瓦窑堡召开扩大会议，确立(    )的基本策略。"
        },
        {
          id: 121,
          val: "A.平型关        B.台儿庄       C.忻口",
          key: "A",
          name:
            "1937年八路军在山西(    )附近取得的对日伏击战的胜利，击毙日军1000余人，击毁汽车100余辆，缴获了一批辎重和武器，有力地配合了正面战场的防御作战，打破了日军不可战胜的神话。"
        },
        {
          id: 122,
          val: "A.毛泽东思想    B.马克思主义    C.列宁主义",
          key: "A",
          name:
            "1945年4月至6月在延安召开的党的第七次全国代表大会，确立(    )为党的指导思想，制定了正确的路线.方针和政策，选举产生了以毛泽东同志为核心的坚强的中央领导集体。"
        },
        {
          id: 123,
          val: "A.文风          B.会风             C.政风",
          key: "A",
          name:
            "延安整风运动的根本任务是反对主观主义以整顿学风.反对宗派主义以整顿党风.反对党八股以整顿(    )。"
        },
        {
          id: 124,
          val: "A.1954         B.1955        C.1956 ",
          key: "C",
          name:
            "(    )年，社会主义改造基本完成，在中国实现了生产资料所有制的深刻变革，表明社会主义经济基础已经初步建立起来，标志着我国进入社会主义初级阶段。"
        },
        {
          id: 125,
          val: "A.《实践论》    B.《论十大关系》   C.《矛盾论》",
          key: "B",
          name:
            "1956年4月，毛泽东发表(    )的讲话，是中国共产党比较系统地探索中国自己的建设社会主义道路的开始。"
        },
        {
          id: 126,
          val: "A.百家争鸣      B.一枝独秀        C.鼓励争论",
          key: "A",
          name:
            "党中央在讨论十大关系的过程中确定的党领导科学和文化的基本方针是“百花齐放.(    )”。		"
        },
        {
          id: 127,
          val: "A.阶级斗争	    B.发展生产     C.经济建设",
          key: "C",
          name:
            "1956年9月15日至27日，中国共产党第八次全国代表大会在北京举行。大会确定了以(    )为中心的政治路线，提出了坚持既反对保守又反对冒进，在综合平衡中稳步前进的经济建设方针。"
        },
        {
          id: 128,
          val: "A.群众观念      B.群众路线     C.密切联系群众",
          key: "B",
          name:
            "在1956年召开的党的八大上，邓小平的《关于修改党的章程的报告》深刻系统地阐述了(    )是党的根本路线这一重要观点。"
        },
        {
          id: 129,
          val: "A.经济体制改革	     B.对外开放      C.改革开放",
          key: "C",
          name:
            "1978年12月18日至22日，中共中央召开党的十一届三中全会。全会认为应当及时地.果断地把党和国家的工作中心转移到经济建设上来.实行(    )的历史性决策。"
        },
        {
          id: 130,
          val: "A.青岛          B.厦门         C.宁波    ",
          key: "B",
          name:
            "1980年8月26日，第五届全国人大常委会第15次会议批准了国务院提出在深圳.珠海.汕头和（    ）建立经济特区的决定。"
        },
        {
          id: 131,
          val:
            "A.《关于党内政治生活的若干准则》   B.《目前的形势和任务》  C.《关于建国以来党的若干历史问题的决议》",
          key: "C",
          name:
            "1981年6月27日至29日，党的十一届六中全会在北京举行。全会审议和通过了(    )，这次全会及其通过的“历史决议”，完成了中国共产党在指导思想上的拨乱反正。"
        },
        {
          id: 132,
          val: "A.社会生产力    B.经济总量    C.社会主义民主政治",
          key: "A",
          name:
            ".党的十二届三中全会通过的《关于经济体制改革的决定》指出，要把是否有利于发展(    )作为检验一切改革得失成败的最主要标准。"
        },
        {
          id: 133,
          val: "A.十一大      B.十二大       C.十三大",
          key: "C",
          name:
            "1987年，党的(    )报告指出党在社会主义初级阶段的基本路线是：领导和团结全国各族人民，以经济建设为中心，坚持四项基本原则，坚持改革开放，自力更生，艰苦创业，为把我国建设成为富强.民主.文明的社会主义现代化国家而奋斗。"
        },
        {
          id: 134,
          val: "A.第一驱动力     B.第一发展力     C.第一生产力",
          key: "C",
          name:
            "1988年9月，邓小平提出“科学技术是(    )”的著名论断。这一论断，体现了中国共产党对科学技术的高度重视和远见卓识。"
        },
        {
          id: 135,
          val: "A.第一驱动力     B.第一发展力     C.第一生产力",
          key: "C",
          name:
            "1988年9月，邓小平提出“科学技术是(    )”的著名论断。这一论断，体现了中国共产党对科学技术的高度重视和远见卓识。"
        }
      ]
    };
  },
  methods: {
    radom() {
      // var num = Math.floor(Math.random() * 135 + 1);
      location.reload(); // 刷新页面
    },
    on() {
      this.$Message.success("返回成功");
      this.$router.push("/simulation");
    },
    cancel() {
      this.$Message.error("取消返回");
    },
    multipleChoice() {
      this.$router.push("/multipleChoice");
      console.log(1);
    },
    submit() {
      this.answer = ""; //答案选项显示
    },
    xx() {}
  }
};
</script>

<style lang="less" scoped>
.all {
  .header {
    padding: 10px 20px 0px 20px;
    font-size: 18px;
    font-weight: bold;
    height: 5%;
    display: flex;
    justify-content: space-between;
  }
  .body {
    overflow: auto;
    width: 100%;
    height: 100%;
  }
}
</style>

<style lang="less">
</style>
